let dictionary = {
    "words" : {
        "Кафиф" : "мем про серого кота с оранжевыми глазами",
        "Пися" : "мем про рыжего кота, пися < кафи",
        "Фафиф" : "Ненастоящий кафиф",
        "Рекафиф" : "Жалкая пародия на кафифа",
        "Кошк" : "кошка в мужском роде, чего вы ожидали?",
        "Тафиф" : "кафиф, но от NXISE'а",
        "Аж Под" : "данное выражение содержит филосовский смысл, понятный не каждому",
        "Рвал(о)" : "местоимение используемое для обращения к какому-то человеку так, чтобы он не понял этого",
        "Termos" : "несуществующее слово с закосом под латынь, имеет значение при упоминании особых событий",
        "Фура" : "сокращение от слова furry, смысл которого наверное вы и сами знаете",
        "Олух (иногда ещё и болван)" : "лёгкое оскорбление, обычно не является нарушением правил 1.1, 1.3, 1.7 на сервере",
        "Ож, Об" : 'чаще всего является усилением к "Аж Под"',
        "Не могу найти в интернете" : "распространённая цитата, выражающая злость к чему-либо",
        "Полка" : 'обычно под этим понятием подразумевается сервер миобомба "Полка объектов", GDPS Helper агрессивно настроен к нему',
        "Сервер *" : "в чате дс сервера иногда так упоминают полку, из-за форматирования в дискорде 5* превращаются в 1*",
        "Кирилл Абрамов" : "настоящее имя фунарки, является мемом (не особо популярным)",
        "ПДО" : "нынче неактуальная Противо Джуртанская Организация, она занималась рейдами гдпс-ов, создатель fippi",
        "The morning" : "имеет значение смены, перевода темы, никак не связано с переводом на русский язык",
        "Для развития бизнеса" : "обычно это выражение означает серьёзные намерения при разговоре по определённой теме",
        "ФС" : 'расшифровка "фурри сервер", обычно применяют к полке',
        "Мр мяууу муррр мяяяяу" : "данный термин появился благодаря нику бывшего модератора сервера, обычно дополняет обсуждение фурри",
        "Фиксация" : "важный скриншот, пошло после бана хелперовцев на полке",
        "Хелперпостинг" : "Мемы в виде комиксов с сообщениями из дискорд сервера хелпера",
    },
    "goodPeoples" : {
        "MIOBOMB (Мио)" : "раньше его неплохо уважали, сейчас это просто владелец сервера и gdpshelper.xyz",
        "Vustur (Вустур)" : "крутая персона на дискорд сервере, обожает фурри и arch linux",
        "DenisC (Денисц)" : "рандомный зануда с малым активом на админке, над ним рофлят😔",
        "NXISE (Нксайз)" : "главный рофлер сервера, большая часть сленга придумана им",
        "n3vesl1s, qundikus (Кундикус)" : "создатель словаря, крутой рофлер сервера, антифурриеб и фанат кафифа",
        "Therealdecor, Ghiggi (Гхигги)" : "крутой рофлер сервера, как и нксайз задаёт различный сленг",
        "Mchiden (Мчи)" : "плоды воображения миобомба, он с этого аккаунта притворялся женщиной",
        "kirilloker (Фунарка)" : "бывший админ сервера, немного неадекват",
        "n/a (Эрнити)" : 'первый владелец GDPS Helper, название сервера изначально было "Поиск гдпс"',
        "frezz.e (Фриз)" : "бывший модер, токсичный человек, рофлер сервера",
        "faixus (Фаиксус)" : "рофлер сервера, админ, фанат писи",
        "kot_v_palto (Кот)" : "багхантер gdpshelper.xyz, создал бота для сервера, который никому не нужен😔",
        "chuvirlik3 (Чувырлик)" : "рандомный школьник, предполагаемый возраст 12 лет, рофлер сервера",
        "mebauu (Мебау)" : "бывший хелпер на сервере, является преданным фанатом и сооснователем мема про писю",
        "Stylish (Стилиш)" : "крутой типочек, помогал при создании словаря",
        "Nosleep (Ноуслип)" : "админ на сервере, не особо активный, по информации вустура является представителем фурри",
        "Spiderr768" : "ходят слухи что он до сих пор рисует фурри керфускиссера"
    },
    "badPeoples" : {
        "Pib0cit (Пивозавр)" : "лицемерный человек и мем, является одной из причин бана хелперовцев на полке",
        "aznake (Знк)" : "самый душный админ на сервере, так же является админом гов гдпс",
        "Gow.gg (Гов)" : "просто неактивный чел, его недолюбливают из-за гов гдпс",
        "fippi (Фиппи)" : "в основном отношение к нему нейтральное, но так как он рейдил джуртан, миобомб его забанил"
    },
    "gdpsOwners" : {
      "timspects" : "владелец SonarGDPS",
      "maxbaxwer" : "владелец GreenGDPS",
      "frezz.e" : "владелец FavouriteGDPS",
      "Stylish" : "владелец StylishPS",
      "nobodyforeveryone" : "владелец GDSFP",
      "kmair" : "владелец ReGDS Legacy",
      "difaer" : "владелец Geofaer Legacy",
      "Ezzy" : "владелец Ezzy's GDPS",
      "kot_v_palto" : "владелец нынче мёртвого KotGDPS",
      "mebauu" : "владелец нынче мёртвого XoneGDPS"
    },
    "dates" : {
      "17.11.2021" : "создание дс сервера GDPS Helper (Поиск гдпс), его владельцами были эрнити с миобомбом",
      "14.01.2023" : "начало первой демократии",
      "19.03.2023" : "начало вторжения в ошк",
      "28.03.2023" : "конец первой демократии",
      "18.06.2023" : "создание сайта gdpshelper.xyz",
      "02.03.2024" : "обновление сайта GDPS Helper (1.6)",
      "06.04.2024" : "создание словаря GDPS Helper'а",
      "07.04.2024" : "обновление словаря (1.1)",
      "09.04.2024" : "обновление словаря (1.2)",
      "11.04.2024" : "выход переработанного словаря (1.3)",
      "19.04.2024" : "обновление словаря (1.4)",
      "21.04.2024" : "начало постепенного обновление словаря (1.5)",
      "26.04.2024" : "конец постепенного обновления словаря (1.5)",
      "05.05.2024" : "обновление словаря (1.6) + появление кафигена",
      "31.05.2024" : "обновление сайта GDPS Helper (1.7)",
      "08.06.2024" : "обновление сайта GDPS Helper (1.7.1 - Перевод об жалобный)",
      "20.06.2024" : "крупное обновление словаря (1.7) + появление галереи"
    },
    "discordRules" : {
      "1.1" : "относитесь ко всем с уважением",
      "1.2" : "запрещено флудить, спамить, создавать сообщения цепочки",
      "1.3" : "запрещено вести себя неадекватно (cюда можно отнести сообщения не несущие смысла)",
      "1.4" : "запрещено пинговать без весомой причины участников и роли",
      "1.5" : "запрещено писать сообщения, которые не подходят под тематику канала (оффтоп)",
      "1.6" : "запрещён NSFW-контент, и прочий шокирующий или намекающий на подобное контент",
      "1.7" : "запрещено разжигать конфликты",
      "1.8" : "запрещена дискриминация по любому признаку - гендерному, расовому, национальному и т.д",
      "1.9" : "запрещено поднимать политические или религиозные темы",
      "1.10" : "запрещено разглашение любой персональной информации (собственной и чужой)",
      "1.11" : "запрещено заниматься рекламой, скамом, фишингом, к-продажей без разрешения админов",
      "1.12" : "запрещены деструктивные действия на сервере (призыв покинуть сервер, необоснованная критика сервера или админов)",
      "1.13" : "запрещено приглашать на сервер твинк-аккаунты с целью обхода основного наказания",
    }
};

// list & copy function

function changeExpState(id) {
  let parentDiv = document.getElementById(id);
  console.log(parentDiv.children.length)
  console.log(parentDiv.children.length == 1)
  if (parentDiv.children.length == 1){
    for (const [key2, value2] of Object.entries(dictionary[id])) {
      let defention = document.createElement("p");
      defention.innerHTML = key2 + " - " + value2;
      defention.onclick = function() {
        navigator.clipboard.writeText(key2 + " - " + value2 + " (https://n3vesl1s.github.io/dict/)");
        const copyAlert = document.getElementById("copyMessage");
        copyAlert.style.display = "block";
        console.log ("visible")
        setTimeout(() => {
          copyAlert.style.display = "none";
          console.log("hidden")
      }, 2000);
      }
      parentDiv.appendChild(defention);
    }
  } else {
    while (parentDiv.children.length != 1) {
      parentDiv.removeChild(parentDiv.lastChild);
    }
  }
}

// thx vustur for this js code🤩🤩💋
// vustur furno
